console.log('tsk 4.01');
/*


Функції не відрізняються від чисел, рядків або масивів
 - це просто спеціальний тип даних (об'єкт вищого порядку),
  значення, яке можна зберігати у змінній або передавати 
  у якості аргументу в іншу функцію.

function greet(name) {
  return `Ласкаво просимо ${name}.`;
}

// Викликаємо функцію greet
// і виводимо результат у консоль
console.log(greet("Mango"));
// Ласкаво просимо Манго.

// Виводимо функцію greet
// у консоль, не викликаючи її
console.log(greet);
////
ƒ greet() {
     return `Ласкаво просимо ${name}.`;
}//

У першому лозі ми викликаємо функцію greet за допомогою круглих дужок, 
і в консоль виводиться результат її виконання. У другому лозі передається
 посилання на функцію, а не результат її виклику (відсутні круглі дужки),
  тому в консоль виводиться її тіло. Це означає, що функцію можна присвоїти 
  у змінну або передати як аругмент іншої функції.

*/
/*
Доповни код таким чином, щоб у змінній result був результат виконання функції
 makePizza, а у змінній pointer було посилання на функцію makePizza.

    Оголошена функція makePizza
    Оголошена змінна result
    Значення змінної result - це рядок "Your pizza is being prepared, please wait."
    Значення змінної result отримане за допомогою виклику функції
    Оголошена змінна pointer
    Значення змінної pointer - це посилання на функцію makePizza

*/